# Stationing Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..Stationing Property
SpecTypeId Class See Also
---
Stationing, in discipline Infrastructure.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Stationing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Stationing As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Stationing {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace